---
kind: other
id: Methods.T:Autodesk.Revit.ApplicationServices.Application
source: html/4b1995d1-6bb2-bc12-7f9f-05200cc08d0d.htm
---
# Application Methods

Copies an existing model to a new file. Overwriting a file of the same name is allowed.